Ran Plan for project: `staging` dir: `terraform` workspace: `staging`

<details><summary>Show Output</summary>

```diff
+---------+----------------------------------------------------------------------------------+-----------+---------+
| RESULT  |                                       FILE                                       | NAMESPACE | MESSAGE |
+---------+----------------------------------------------------------------------------------+-----------+---------+
| success | /atlantis-data/repos/leandromoreirati/mystorage/1/staging/terraform/versions.tf  | main      | SUCCESS |
| success | /atlantis-data/repos/leandromoreirati/mystorage/1/staging/terraform/backend.tf   | main      | SUCCESS |
| success | /atlantis-data/repos/leandromoreirati/mystorage/1/staging/terraform/main.tf      | main      | SUCCESS |
| success | /atlantis-data/repos/leandromoreirati/mystorage/1/staging/terraform/outputs.tf   | main      | SUCCESS |
| success | /atlantis-data/repos/leandromoreirati/mystorage/1/staging/terraform/providers.tf | main      | SUCCESS |
| success | /atlantis-data/repos/leandromoreirati/mystorage/1/staging/terraform/variables.tf | main      | SUCCESS |
+---------+----------------------------------------------------------------------------------+-----------+---------+

2024-08-06T12:57:06.659Z [INFO]  Terraform version: 1.4.6
2024-08-06T12:57:06.659Z [INFO]  Go runtime version: go1.19.6
2024-08-06T12:57:06.659Z [INFO]  CLI args: []string{"/atlantis-data/bin/terraform1.4.6", "plan", "-input=false", "-refresh", "-out", "/atlantis-data/repos/leandromoreirati/mystorage/1/staging/terraform/staging-staging.tfplan", "-var-file", "environments/staging.tfvars.json"}
2024-08-06T12:57:06.660Z [INFO]  CLI command args: []string{"plan", "-input=false", "-refresh", "-out", "/atlantis-data/repos/leandromoreirati/mystorage/1/staging/terraform/staging-staging.tfplan", "-var-file", "environments/staging.tfvars.json"}
2024-08-06T12:57:16.429Z [INFO]  backend/local: starting Plan operation
2024-08-06T12:57:16.725Z [INFO]  provider: configuring client automatic mTLS
2024-08-06T12:57:17.157Z [INFO]  provider.terraform-provider-azurerm_v3.114.0_x5: configuring server automatic mTLS: timestamp=2024-08-06T12:57:17.157Z
2024-08-06T12:57:23.452Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:23.452Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:23.452Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:23.452Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:23.452Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:23.452Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:23.452Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:23.452Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:23.452Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:23.452Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:23.452Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:23.452Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:23.452Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:23.452Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:23.452Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:23.452Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:23.452Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:23.452Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:23.452Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:23.452Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:23.452Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:23.452Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:23.452Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:23.452Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:23.452Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:23.452Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:23.452Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:23.452Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:23.452Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:23.452Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:23.452Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:23.453Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:23.453Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:23.453Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:23.453Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:23.453Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:23.483Z [INFO]  provider: configuring client automatic mTLS
2024-08-06T12:57:23.663Z [INFO]  provider.terraform-provider-azurerm_v3.114.0_x5: configuring server automatic mTLS: timestamp=2024-08-06T12:57:23.662Z
2024-08-06T12:57:30.254Z [INFO]  backend/local: plan calling Plan
2024-08-06T12:57:30.256Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:30.256Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:30.256Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:30.256Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:30.256Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:30.256Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:30.256Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:30.256Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:30.256Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:30.256Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:30.256Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:30.256Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:30.256Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:30.256Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:30.256Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:30.256Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:30.256Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:30.256Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:30.256Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:30.256Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:30.256Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:30.256Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:30.256Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:30.256Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:30.256Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:30.256Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:30.256Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:30.256Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:30.256Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:30.256Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:30.256Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:30.256Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:30.256Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:30.256Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:30.256Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:30.256Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:30.368Z [INFO]  provider: configuring client automatic mTLS
2024-08-06T12:57:30.565Z [INFO]  provider.terraform-provider-azurerm_v3.114.0_x5: configuring server automatic mTLS: timestamp=2024-08-06T12:57:30.565Z
2024-08-06T12:57:37.063Z [WARN]  ValidateProviderConfig from "provider[\"registry.terraform.io/hashicorp/azurerm\"]" changed the config value, but that value is unused
2024-08-06T12:57:45.455Z [INFO]  ReferenceTransformer: reference not found: "var.storage_accounts"
2024-08-06T12:57:45.455Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:45.455Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:45.455Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:45.455Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:45.455Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:45.455Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:45.455Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:45.455Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:45.455Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:45.455Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:45.455Z [INFO]  ReferenceTransformer: reference not found: "var.tags"
2024-08-06T12:57:45.455Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:45.455Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:45.455Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:45.455Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:45.455Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:45.455Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:45.455Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:45.455Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:45.455Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:45.455Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:45.455Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:45.455Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:45.455Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:45.455Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:45.455Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:45.455Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:45.455Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:45.455Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:45.455Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:45.455Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:45.455Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:45.455Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:45.455Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:45.455Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:45.455Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:45.455Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:45.553Z [WARN]  provider.terraform-provider-azurerm_v3.114.0_x5: Response contains warning diagnostic: diagnostic_attribute=AttributeName("enable_https_traffic_only") diagnostic_severity=WARNING tf_proto_version=5.6 tf_provider_addr=provider @caller=github.com/hashicorp/terraform-plugin-go@v0.23.0/tfprotov5/internal/diag/diagnostics.go:60 diagnostic_summary="Argument is deprecated" tf_resource_type=azurerm_storage_account tf_rpc=ValidateResourceTypeConfig @module=sdk.proto diagnostic_detail="The property `enable_https_traffic_only` has been superseded by `https_traffic_only_enabled` and will be removed in v4.0 of the AzureRM Provider." tf_req_id=cdb65e0e-12f1-bce3-ba25-61d3dcc4df52 timestamp=2024-08-06T12:57:45.553Z
2024-08-06T12:57:45.752Z [WARN]  Provider "registry.terraform.io/hashicorp/azurerm" produced an invalid plan for module.storage.azurerm_storage_account.default["demo"], but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .dns_endpoint_type: planned value cty.StringVal("Standard") for a non-computed attribute
      - .sftp_enabled: planned value cty.False for a non-computed attribute
      - .local_user_enabled: planned value cty.True for a non-computed attribute
      - .tags: planned value cty.NullVal(cty.Map(cty.String)) does not match config value cty.MapValEmpty(cty.String)
      - .routing: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
      - .share_properties: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
      - .queue_properties: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
      - .network_rules: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
      - .blob_properties: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
2024-08-06T12:57:46.153Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:46.153Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:46.153Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:46.153Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:46.153Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:46.153Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:46.153Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:46.153Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:46.153Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:46.153Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:46.153Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:46.153Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:46.153Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:46.153Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:46.153Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:46.153Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:46.153Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:46.153Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:46.153Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:46.153Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:46.153Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:46.153Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:46.153Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:46.153Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:46.153Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:46.153Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:46.153Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:46.153Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:46.153Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:46.153Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:46.153Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:46.153Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:46.153Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:46.153Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:46.153Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:46.153Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-06T12:57:46.155Z [INFO]  backend/local: plan operation completed
2024-08-06T12:57:46.155Z [INFO]  backend/local: writing plan output to: /atlantis-data/repos/leandromoreirati/mystorage/1/staging/terraform/staging-staging.tfplan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.storage.azurerm_storage_account.default["demo"] will be created
+ resource "azurerm_storage_account" "default" {
+       access_tier                        = "Hot"
+       account_kind                       = "StorageV2"
+       account_replication_type           = "LRS"
+       account_tier                       = "Standard"
+       allow_nested_items_to_be_public    = false
+       cross_tenant_replication_enabled   = false
+       default_to_oauth_authentication    = false
+       dns_endpoint_type                  = "Standard"
+       enable_https_traffic_only          = true
+       https_traffic_only_enabled         = (known after apply)
+       id                                 = (known after apply)
+       infrastructure_encryption_enabled  = false
+       is_hns_enabled                     = false
+       large_file_share_enabled           = false
+       local_user_enabled                 = true
+       location                           = "eastus"
+       min_tls_version                    = "TLS1_2"
+       name                               = "mystorage"
+       nfsv3_enabled                      = false
+       primary_access_key                 = (sensitive value)
+       primary_blob_connection_string     = (sensitive value)
+       primary_blob_endpoint              = (known after apply)
+       primary_blob_host                  = (known after apply)
+       primary_blob_internet_endpoint     = (known after apply)
+       primary_blob_internet_host         = (known after apply)
+       primary_blob_microsoft_endpoint    = (known after apply)
+       primary_blob_microsoft_host        = (known after apply)
+       primary_connection_string          = (sensitive value)
+       primary_dfs_endpoint               = (known after apply)
+       primary_dfs_host                   = (known after apply)
+       primary_dfs_internet_endpoint      = (known after apply)
+       primary_dfs_internet_host          = (known after apply)
+       primary_dfs_microsoft_endpoint     = (known after apply)
+       primary_dfs_microsoft_host         = (known after apply)
+       primary_file_endpoint              = (known after apply)
+       primary_file_host                  = (known after apply)
+       primary_file_internet_endpoint     = (known after apply)
+       primary_file_internet_host         = (known after apply)
+       primary_file_microsoft_endpoint    = (known after apply)
+       primary_file_microsoft_host        = (known after apply)
+       primary_location                   = (known after apply)
+       primary_queue_endpoint             = (known after apply)
+       primary_queue_host                 = (known after apply)
+       primary_queue_microsoft_endpoint   = (known after apply)
+       primary_queue_microsoft_host       = (known after apply)
+       primary_table_endpoint             = (known after apply)
+       primary_table_host                 = (known after apply)
+       primary_table_microsoft_endpoint   = (known after apply)
+       primary_table_microsoft_host       = (known after apply)
+       primary_web_endpoint               = (known after apply)
+       primary_web_host                   = (known after apply)
+       primary_web_internet_endpoint      = (known after apply)
+       primary_web_internet_host          = (known after apply)
+       primary_web_microsoft_endpoint     = (known after apply)
+       primary_web_microsoft_host         = (known after apply)
+       public_network_access_enabled      = false
+       queue_encryption_key_type          = "Service"
+       resource_group_name                = "my-rg"
+       secondary_access_key               = (sensitive value)
+       secondary_blob_connection_string   = (sensitive value)
+       secondary_blob_endpoint            = (known after apply)
+       secondary_blob_host                = (known after apply)
+       secondary_blob_internet_endpoint   = (known after apply)
+       secondary_blob_internet_host       = (known after apply)
+       secondary_blob_microsoft_endpoint  = (known after apply)
+       secondary_blob_microsoft_host      = (known after apply)
+       secondary_connection_string        = (sensitive value)
+       secondary_dfs_endpoint             = (known after apply)
+       secondary_dfs_host                 = (known after apply)
+       secondary_dfs_internet_endpoint    = (known after apply)
+       secondary_dfs_internet_host        = (known after apply)
+       secondary_dfs_microsoft_endpoint   = (known after apply)
+       secondary_dfs_microsoft_host       = (known after apply)
+       secondary_file_endpoint            = (known after apply)
+       secondary_file_host                = (known after apply)
+       secondary_file_internet_endpoint   = (known after apply)
+       secondary_file_internet_host       = (known after apply)
+       secondary_file_microsoft_endpoint  = (known after apply)
+       secondary_file_microsoft_host      = (known after apply)
+       secondary_location                 = (known after apply)
+       secondary_queue_endpoint           = (known after apply)
+       secondary_queue_host               = (known after apply)
+       secondary_queue_microsoft_endpoint = (known after apply)
+       secondary_queue_microsoft_host     = (known after apply)
+       secondary_table_endpoint           = (known after apply)
+       secondary_table_host               = (known after apply)
+       secondary_table_microsoft_endpoint = (known after apply)
+       secondary_table_microsoft_host     = (known after apply)
+       secondary_web_endpoint             = (known after apply)
+       secondary_web_host                 = (known after apply)
+       secondary_web_internet_endpoint    = (known after apply)
+       secondary_web_internet_host        = (known after apply)
+       secondary_web_microsoft_endpoint   = (known after apply)
+       secondary_web_microsoft_host       = (known after apply)
+       sftp_enabled                       = false
+       shared_access_key_enabled          = true
+       table_encryption_key_type          = "Service"
    }

Plan: 1 to add, 0 to change, 0 to destroy.
╷
│ Warning: Argument is deprecated
│ 
│   with module.storage.azurerm_storage_account.default["demo"],
│   on .terraform/modules/storage/main.tf line 13, in resource "azurerm_storage_account" "default":
│   13:   enable_https_traffic_only = lookup(each.value, "enable_https_traffic_only", true)
│ 
│ The property `enable_https_traffic_only` has been superseded by
│ `https_traffic_only_enabled` and will be removed in v4.0 of the AzureRM
│ Provider.
╵

2024-08-06T12:58:06Z ERROR Could not autodetect any projects from path "/atlantis-data/repos/leandromoreirati/mystorage/1/staging/terraform/staging-staging.json"
2024-08-06T12:58:06Z INFO Output saved to /tmp/leandromoreirati-mystorage-1/staging-terraform-infracost.json

Update: A new version of Infracost is available: v0.10.37 → v0.10.38
  $ curl -fsSL https://raw.githubusercontent.com/infracost/infracost/master/scripts/install.sh | sh
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p staging
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://4.236.202.77/lock?id=leandromoreirati%252Fmystorage%252Fterraform%252Fstaging)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p staging
  ```
Plan: 1 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```